{
  "summary": "Results-driven Senior Software Engineer with experience building scalable backend and full stack systems using Java, Kotlin, SQL/NoSQL, and cloud platforms. Proven success delivering high-impact services, improving observability and reliability, and driving measurable outcomes across systems serving millions of users. Adept at cross-functional collaboration, rapid problem solving, and improving team velocity through code quality and mentorship.",
  "summaryAlt": "Senior Software Engineer focused on backend reliability and full stack delivery, specializing in Java/Kotlin services, cloud platforms, and product collaboration to ship measurable outcomes.",
  "downloads": [
    {
      "label": "Backend & Systems PDF",
      "href": "/resume/king-simmons-backend-systems.pdf"
    },
    {
      "label": "UI / Product PDF",
      "href": "/resume/king-simmons-ui-product.pdf"
    }
  ],
  "highlights": [
    {
      "summary": "5+ years building scalable backend systems in production environments.",
      "detail": "Designed and operated distributed services using Java, Kotlin, Spring Boot, SQL/NoSQL, and cloud messaging systems."
    },
    {
      "summary": "Improved observability, reliability, and delivery speed across critical services.",
      "detail": "Led tracing, testing, and deployment improvements that reduced debugging time and accelerated releases."
    },
    {
      "summary": "Delivered features impacting millions of users across consumer and internal platforms.",
      "detail": "Worked cross-functionally with product, design, and infrastructure teams to ship high-impact solutions."
    }
  ],
  "highlightsAlt": [
    {
      "summary": "5+ years delivering backend and full stack features for user-facing products.",
      "detail": "Built React components and GraphQL-backed services to improve usability and discoverability."
    },
    {
      "summary": "Led cross-functional initiatives that improved engagement and adoption.",
      "detail": "Partnered with UX, PMs, and stakeholders to ship measurable product improvements."
    },
    {
      "summary": "Mentored engineers and improved team execution through process and tooling.",
      "detail": "Introduced quality and workflow improvements that increased team velocity."
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "The Home Depot",
      "period": "August 2025 — Present",
      "summary": "Led backend reliability and observability improvements for high-volume pricing and logistics systems.",
      "summaryAlt": "Drove cross-service improvements in testing, deployment, and cloud operations for internal platforms.",
      "impact": [
        {
          "summary": "Implemented trace context propagation across Pub/Sub services, reducing root-cause debugging time by 30%.",
          "detail": "Enabled end-to-end observability across distributed services handling pricing, logistics, and vendor communication."
        },
        {
          "summary": "Built a reusable E2E testing framework that reduced manual setup time by 50%.",
          "detail": "Created templates, dynamic test data generators, and onboarding documentation to standardize testing."
        },
        {
          "summary": "Delivered last-minute architectural fixes to unblock critical production deployments.",
          "detail": "Resolved blocking issues under tight deadlines, preserving delivery timelines for systems used by 1,000+ internal users."
        },
        {
          "summary": "Owned and optimized GCP resources processing 100,000+ daily events.",
          "detail": "Managed Pub/Sub topics, BigQuery tables, and scheduled queries to ensure reliable data flow."
        },
        {
          "summary": "Led backend deployments and schema changes across 5+ services with zero downtime.",
          "detail": "Coordinated PostgreSQL and Oracle schema changes while maintaining production stability."
        }
      ],
      "impactAlt": [
        {
          "summary": "Improved distributed system observability by implementing trace propagation across services.",
          "detail": "Collaborated with cross-functional teams to debug and validate end-to-end request flows."
        },
        {
          "summary": "Introduced reusable E2E testing patterns to accelerate service onboarding.",
          "detail": "Reduced setup friction for engineers by standardizing test scaffolding and documentation."
        },
        {
          "summary": "Unblocked time-sensitive production releases through targeted architectural fixes.",
          "detail": "Worked closely with stakeholders to meet delivery commitments."
        },
        {
          "summary": "Managed cloud infrastructure supporting high-volume event processing.",
          "detail": "Ensured reliability and correctness across messaging and analytics pipelines."
        },
        {
          "summary": "Executed coordinated backend releases across multiple services.",
          "detail": "Maintained reliability standards during schema and deployment changes."
        }
      ]
    },
    {
      "role": "Software Engineer",
      "company": "Indeed",
      "period": "May 2022 — July 2025",
      "summary": "Built backend services that improved profile completeness and discovery at global scale.",
      "summaryAlt": "Shipped full stack experiments and mentorship initiatives to improve engagement and team execution.",
      "impact": [
        {
          "summary": "Designed and launched a profile enrichment system increasing profile completeness by 50%.",
          "detail": "Built backend services using Java, Kotlin, Spring Boot, PostgreSQL, and AWS S3."
        },
        {
          "summary": "Enabled profile-based discovery for 40M+ US and 230M+ global users.",
          "detail": "Led backend service development, resolved 10+ production issues, and built adoption dashboards."
        },
        {
          "summary": "Built scalable microservices with Kotlin and Spring Boot integrated with PostgreSQL and AWS.",
          "detail": "Automated infrastructure setup and service interactions to support long-term scalability."
        },
        {
          "summary": "Improved email engagement by 15–20% through backend and frontend A/B testing.",
          "detail": "Partnered with product and UX to optimize messaging and delivery flows."
        },
        {
          "summary": "Mentored 3+ engineers and introduced process improvements post-reorg.",
          "detail": "Led retrospectives and supported onboarding to improve team communication."
        }
      ],
      "impactAlt": [
        {
          "summary": "Delivered a profile enrichment system that significantly improved user discoverability.",
          "detail": "Worked across backend services and UI surfaces to support richer profiles."
        },
        {
          "summary": "Led launch-critical efforts to expand profile-based discovery at global scale.",
          "detail": "Resolved bugs, enhanced UI flows, and monitored adoption metrics."
        },
        {
          "summary": "Contributed full stack improvements alongside backend service development.",
          "detail": "Collaborated with designers to improve usability and performance."
        },
        {
          "summary": "Improved engagement metrics through coordinated frontend and backend experimentation.",
          "detail": "Used A/B testing to inform product decisions."
        },
        {
          "summary": "Supported team growth through mentorship and process leadership.",
          "detail": "Helped stabilize execution during organizational changes."
        }
      ]
    },
    {
      "role": "Software Engineer – Backend Testing & Reliability",
      "company": "General Motors",
      "period": "January 2021 — April 2022",
      "summary": "Automated backend testing and CI/CD improvements for enterprise reliability initiatives.",
      "summaryAlt": "Focused on reliability through automated UI/API coverage and agile delivery practices.",
      "impact": [
        {
          "summary": "Automated UI and REST API tests for 15+ features, reducing regression testing time by 50%.",
          "detail": "Used Java, Selenium, and REST Assured to validate backend service integrations."
        },
        {
          "summary": "Improved CI/CD workflows to increase iteration velocity by 37%.",
          "detail": "Enhanced automated testing pipelines in a SAFe Agile environment."
        }
      ],
      "impactAlt": [
        {
          "summary": "Built automated test coverage to ensure backend service reliability.",
          "detail": "Collaborated with developers and QA to define acceptance criteria."
        },
        {
          "summary": "Streamlined test automation processes to accelerate delivery.",
          "detail": "Integrated testing improvements into CI/CD pipelines."
        }
      ]
    }
  ],
  "skills": [
    "Java",
    "Kotlin",
    "Python",
    "Spring Boot",
    "GraphQL",
    "PostgreSQL",
    "REST APIs",
    "AWS",
    "GCP",
    "Docker",
    "Pub/Sub",
    "React",
    "TypeScript",
    "Observability",
    "Tracing",
    "CI/CD",
    "Automated Testing",
    "Agile"
  ],
  "skillsAlt": [
    "React",
    "TypeScript",
    "GraphQL",
    "A/B Testing",
    "Product Collaboration",
    "UX Partnership",
    "Observability",
    "Automated Testing"
  ],
  "education": [
    {
      "program": "Bachelor of Science in Computer Science",
      "school": "University of Georgia",
      "year": ""
    }
  ]
}
